{
    "justin-basinger": {
        "slug": "justin-basinger",
        "firstName": "Justin",
        "lastName": "Basinger",
        "bio": "9 years web development, 1 year mobile hybrid development - Delivered a hybrid application to 18 different countries in 5 different languages.",
        "sessions": [
            "ionic-framework"
        ]
    },
    "john-bennett": {
        "slug": "john-bennett",
        "firstName": "John",
        "lastName": "Bennett",
        "bio": "John has been building software and leading teams for over 20 years. He is currently Managing Partner at Thoughtcap, a software product development consultancy based in Providence, RI. His areas of expertise include distributed software architectures, lean product development, DevOps and continuous delivery, and data-center-to-cloud migrations.\n\nJohn previously led the engineering team at Huge, where he oversaw delivery of software, content- and ecommerce-based websites, and mobile apps for clients such as AARP, Comcast, Mass Mutual, and NYU Langone Medical Center.\n\nAs Principal Software Engineer at NBC News Digital, John designed and built the software systems that enable nbcnews.com and today.com to support hundreds of millions of users each month, with hourly code deployments and near-zero downtime.\n\nJohn donates his time and expertise to non-profits including iMentor, Malaika, Blue Ridge Labs @ Robin Hood, and the Social Enterprise Greenhouse.",
        "twitter": {
            "href": "https://twitter.com/jtbennett",
            "title": "jtbennett"
        },
        "sessions": [
            "the-new-new-microsoft"
        ]
    },
    "paul-blasucci": {
        "slug": "paul-blasucci",
        "firstName": "Paul",
        "lastName": "Blasucci",
        "bio": "As a passionate – yet pragmatic – enthusiast of multi-paradigm and polyglot engineering, Paulmichael has spent the past 16 years blending a disparate array of languages, technologies, and methodologies to develop compelling solutions to a wide range of business problems. He especially enjoys solving challenges in distributed computing, visual communications, and heterogeneous enterprise systems. Paulmichael works as a senior software engineer for Quicken Loans. He is also a co-founder of the NashF#: the Nashville F# Meetup and a co-organizer of the New York City F# Users Group. In 2014, he received a Microsoft MVP Award for his work in the .NET community. When not at the keyboard, Paulmichael may be found exploring the metro NYC area with his wife (though his soul is still honky-tonkin' in Nashville, TN).",
        "twitter": {
            "href": "https://twitter.com/pblasucci",
            "title": "pblasucci"
        },
        "sessions": [
            "properties-to-be-checked"
        ]
    },
    "john-cicilio": {
        "slug": "john-cicilio",
        "firstName": "John",
        "lastName": "Cicilio",
        "bio": "John Cicilio works as a Software Architect at MyWebGrocer. John has a passion for the intersection of science, mathematics and technology.",
        "sessions": [
            "restful-api-golang"
        ]
    },
    "michael-commo": {
        "slug": "michael-commo",
        "firstName": "Michael",
        "lastName": "Commo",
        "bio": "Michael Commo is a Senior Software Engineer at Galen Healthcare Solutions, and currently develops enterprise software pertaining to care management and data archival. Prior, Commo wrote data warehousing software for IBM. A VT native, he attended Saint Michaels College and lives in Colchester with his wife.\n\nNot too long ago, Mike Commo and [Mike Tamlyn](/2015/speakers#michael-tamlyn) were part of a team that took first place in HackVT 2013.",
        "sessions": [
            "entity-framework-code-first-migrations"
        ]
    },
    "christian-cote": {
        "slug": "christian-cote",
        "firstName": "Christian",
        "lastName": "Coté",
        "bio": "Christian Coté is a SQL Server MVP specializing in data warehouse and BI.",
        "twitter": {
            "href": "https://twitter.com/Christian_SQL",
            "title": "Christian_SQL"
        },
        "sessions": [
            "self-service-bi-integration-in-corporate-bi"
        ]
    },
    "aaron-cummings": {
        "slug": "aaron-cummings",
        "firstName": "Aaron",
        "lastName": "Cummings",
        "bio": "Aaron Cummings leads a software team within a microelectronics hardware design group, and focuses on systems for design automation. He has worked with imperative and object-oriented languages for the past two decades, but has recently taken an interest in functional programming. Aaron earned a BSCS from UVM, and still resides in the Burlington area. He spends his spare time fixing the things his kids break.",
        "twitter": {
            "href": "https://twitter.com/btvaaron",
            "title": "btvaaron"
        },
        "sessions": [
            "clojure"
        ]
    },
    "jeremy-danyow": {
        "slug": "jeremy-danyow",
        "firstName": "Jeremy",
        "lastName": "Danyow",
        "bio": "Aurelia Core Team member – More at [danyow.net](http://danyow.net)",
        "twitter": {
            "href": "https://twitter.com/dany0w",
            "title": "dany0w"
        },
        "sessions": [
            "aurelia"
        ]
    },
    "hetal-dave": {
        "slug": "hetal-dave",
        "firstName": "Hetal",
        "lastName": "Dave",
        "bio": "Hetal Dave is a Sr. Software Engineer and Technical Lead for C2, an IT consulting company based in Colchester, VT. She has been working in Software Development for over 10 years, helping clients such as Keurig, NRG Systems, Crane & Co., Hershey and Vermont Teddy Bear. Hetal develops eCommerce, CMS and custom applications using .NET, C#, jQuery, AngularJS and other technologies. She is a Microsoft Certified Professional (MCP) and a Sitecore Certified Developer. Hetal holds a Master’s Degree in Computer Science from RIMS in London, UK.",
        "twitter": {
            "href": "https://twitter.com/hetaljdave",
            "title": "hetaljdave"
        },
        "sessions": [
            "clean-code"
        ]
    },
    "scott-douglas": {
        "slug": "scott-douglas",
        "firstName": "Scott",
        "lastName": "Douglas",
        "bio": "Scott Douglas is a Scrum Tech Lead and Senior UI Developer working on the Dealer.com web platform focusing on architecture and developer efficiency. He’s worked as a game programmer on Ultimate Spiderman for the Gameboy Advance, a software engineer working on SmartArt Graphics and Photos for Microsoft Office, and as an Animation Technical Director at DreamWorks Animation on films like How to Train Your Dragon and Megamind.",
        "twitter": {
            "href": "https://twitter.com/uberska",
            "title": "uberska"
        },
        "sessions": [
            "turning-points"
        ]
    },
    "cori-drew": {
        "slug": "cori-drew",
        "firstName": "Cori",
        "lastName": "Drew",
        "bio": "Cori Drew is a senior consultant with Improving Enterprises in Addison, TX. She started her programming career as a web developer before cutting her OOP teeth (& falling in love with C#) in 2003 in .NET Framework 1.1. Cori was a programmer for 8.5 years before discovering there was a developer community in 2009. Appreciation for growth & learning, enabled by our tech community, has inspired her to try to pay it forward.",
        "twitter": {
            "href": "https://twitter.com/coridrew",
            "title": "coridrew"
        },
        "sessions": [
            "git-parable"
        ]
    },
    "ben-glassman": {
        "slug": "ben-glassman",
        "firstName": "Ben",
        "lastName": "Glassman",
        "bio": "Ben is a Full Stack developer and Technical Lead for Vermont Design Works' team of front-end and backend developers working on custom websites and applications. He enjoys talking to people to gain an understanding of their problem and working with a team to come up with recommendations of technical solutions. He also is an experienced and enthusiastic technology educator, whether teaching web development courses at Champlain College or Vermont Works for Women's Step Up to IT program. When not basking in the glow of a computer screen, he can be found riding his bike with his dog Trevor in tow or practicing zymurgy in his basement.",
        "sessions": [
            "es6-today"
        ]
    },
    "michael-hellein": {
        "slug": "michael-hellein",
        "firstName": "Michael",
        "lastName": "Hellein",
        "bio": "Michael Hellein is a web application developer. In 2008, he co-founded the web consultancy Bearded. He currently works at Dealer.com, creating tools and workflows for the developers working with their Website Platform.",
        "sessions": [
            "mithril-and-webpack"
        ]
    },
    "floyd-hilton": {
        "slug": "floyd-hilton",
        "firstName": "Floyd",
        "lastName": "Hilton",
        "bio": "Floyd has 15 years of software development experience in businesses ranging from large scale semiconductor manufacturing to small scale consulting. Floyd's primary interests include improving the quality of software by leveraging version control and repeatable processes. Floyd also enjoy's helping others discover the awesome career of being a software developer.",
        "twitter": {
            "href": "https://twitter.com/fhilton",
            "title": "fhilton"
        },
        "sessions": [
            "sql-schema-and-code-version-control"
        ]
    },
    "jon-hoguet": {
        "slug": "jon-hoguet",
        "firstName": "Jon",
        "lastName": "Hoguet",
        "bio": "Tech Lead, Dealer.com",
        "sessions": [
            "static-web-apps"
        ]
    },
    "nick-husher": {
        "slug": "nick-husher",
        "firstName": "Nick",
        "lastName": "Husher",
        "bio": "Nick Husher is a UI developer for Faraday. He is an advocate for using functional programming concepts in UI development and making the process of building software easier and more humane.",
        "sessions": [
            "clojurescript-and-figwheel"
        ]
    },
    "jeremy-hutchinson": {
        "slug": "jeremy-hutchinson",
        "firstName": "Jeremy",
        "lastName": "Hutchinson",
        "bio": "Jeremy, is a Senior Developer at Ontuitive, has been developing line of business applications for 15 years primarily in the Microsoft Stack. He has a passion for writing clean, scalable code and sharing what he has learned with others.",
        "twitter": {
            "href": "https://twitter.com/hutchcodes",
            "title": "hutchcodes"
        },
        "sessions": [
            "t4-and-visual-studio"
        ]
    },
    "jessica-ingrassellino": {
        "slug": "jessica-ingrassellino",
        "firstName": "Jessica",
        "lastName": "Ingrassellino",
        "bio": "Jess Ingrasselino is a Software Engineer in Test at Bitly. She has worked at several startups in lead positions performing exploratory manual testing as well as creating automated frameworks to aid her testing process. She delivers tech talks in NYC about her testing experiences. Prior to her career in testing, Jessica was a music teacher for ten years, and served as an educational consultant and curriculum writer.\n\nJessica is active in the Python Education community, having co-chaired the Pycon Education Summit for the past two years. She is also working on Teach Code, a non-profit devoted to helping underserved communities get the resources they need to implement code classes as a part of the regular school day. When not working, Jessica enjoys playing violin and viola, as well as designing clothes and reading philosophy. She lives in NYC.",
        "twitter": {
            "href": "https://twitter.com/jess_ingrass",
            "title": "jess_ingrass"
        },
        "sessions": [
            "writing-automated-tests"
        ]
    },
    "josh-lee": {
        "slug": "josh-lee",
        "firstName": "Josh",
        "lastName": "Lee",
        "bio": "As the Director of Marketing at Daft Labs, Josh Lee puts his twelve-plus years of development experience to work, crafting elegant and effective solutions to challenging technological and marketing problems. Josh channels his passion for open source publishing software as the organizer for the Burlington WordPress Group.",
        "twitter": {
            "href": "https://twitter.com/joshleecreates",
            "title": "joshleecreates"
        },
        "sessions": [
            "client-work-with-wordpress"
        ]
    },
    "sophie-marchand": {
        "slug": "sophie-marchand",
        "firstName": "Sophie",
        "lastName": "Marchand",
        "bio": "Sophie Marchand is an Excel MVP specialized in Self Service BI.",
        "sessions": [
            "self-service-bi-integration-in-corporate-bi"
        ]
    },
    "everett-mckay": {
        "slug": "everett-mckay",
        "firstName": "Everett",
        "lastName": "McKay",
        "bio": "Everett McKay is Principal of UX Design Edge, a user experience design training and consulting company for mobile, web, and desktop applications. He has been teaching UX design to software professionals since 2003 and has delivered design workshops to an international audience that includes Europe, Asia, South America, and Africa. Everett is author of \"UI is Communication: How to design intuitive, user-centered user interfaces by focusing on effective communication\", published by Morgan Kaufmann. While at Microsoft, he was responsible for writing and evangelizing the Windows User Experience Guidelines.",
        "twitter": {
            "href": "https://twitter.com/uxdesignedge",
            "title": "uxdesignedge"
        },
        "sessions": [
            "effective-design-reviews"
        ]
    },
    "mitch-miller": {
        "slug": "mitch-miller",
        "firstName": "Mitch",
        "lastName": "Miller",
        "bio": "Mitch Miller is a Ph.D. chemist who has been designing, developing, delivering, and supporting scientific software solutions for over 20 years.\n\nHe is currently Principal Consultant at Scientific Thinking, LLC and works with users, mainly in the pharmaceutical and chemical industries on improving their access to information. The technologies he currently works with include C#, Java, Javascript, Oracle, laboratory automation and workflow applications.",
        "sessions": [
            "visual-programming-for-science-and-business"
        ]
    },
    "kyle-mitofsky": {
        "slug": "kyle-mitofsky",
        "firstName": "Kyle",
        "lastName": "Mitofsky",
        "bio": "Kyle Mitofsky currently serves as the Software Development Team Technical Lead at the Vermont Department of Health. He enjoys reading code, writing code, talking about code, and answering questions about code from co-workers and anonymous strangers on the internet. He's interested in desktop, mobile, and web development technologies, especially if they're on the .NET stack. He blogs about coding at [www.codingeverything.com](http://www.codingeverything.com).",
        "twitter": {
            "href": "https://twitter.com/KyleMit2",
            "title": "KyleMit2"
        },
        "sessions": [
            "meteor-js"
        ]
    },
    "john-need": {
        "slug": "john-need",
        "firstName": "John",
        "lastName": "Need",
        "bio": "Senior UI Developer @ Inntopia",
        "twitter": {
            "href": "https://twitter.com/JohnNeed",
            "title": "JohnNeed"
        },
        "sessions": [
            "react-and-flux"
        ]
    },
    "brandt-newton": {
        "slug": "brandt-newton",
        "firstName": "Brandt",
        "lastName": "Newton",
        "bio": "Brandt Newton is currently a student at the University of Vermont working toward his BS in Computer Science. He is also an intern at Mach7 Technologies.",
        "sessions": [
            "windows-services"
        ]
    },
    "al-ramirez": {
        "slug": "al-ramirez",
        "firstName": "Al",
        "lastName": "Ramirez",
        "bio": "Systems Architect at iSystems in Colchester, Vermont",
        "twitter": {
            "href": "https://twitter.com/mirezez",
            "title": "mirezez"
        },
        "sessions": [
            "social-network-analysis-and-visualization"
        ]
    },
    "rachel-reese": {
        "slug": "rachel-reese",
        "firstName": "Rachel",
        "lastName": "Reese",
        "bio": "Rachel Reese is a long-time software engineer and math geek who can often be found talking to random strangers about the joys of functional programming and F#. She currently works for Jet.com in NYC. She has helped run the Nashville F# User group, @NashFSharp, and the Burlington, VT functional programming user group, @VTFun. She's also an ASPInsider, an F# MVP, a Xamarin MVP, a community enthusiast, one of the founding @lambdaladies, and a Rachii. You can find her on Twitter, [@rachelreese](https://twitter.com/rachelreese), or on her blog: [rachelree.se](http://rachelree.se/).",
        "twitter": {
            "href": "https://twitter.com/rachelreese",
            "title": "rachelreese"
        },
        "sessions": [
            "event-driven-microservices"
        ]
    },
    "eric-smith": {
        "slug": "eric-smith",
        "firstName": "Eric",
        "lastName": "Smith",
        "bio": "Eric is Senior VP of Product Development at Middlebury Interactive Languages. He helps run @VTFun, the VT functional programming users group. Eric seems to be on a never-ending quest to understand the history, future, and nature of computation and its practical development. And he loves to talk about it.",
        "twitter": {
            "href": "https://twitter.com/eric_s_smith",
            "title": "eric_s_smith"
        },
        "sessions": [
            "abstraction"
        ]
    },
    "kip-steele": {
        "slug": "kip-steele",
        "firstName": "Kip",
        "lastName": "Steele",
        "bio": "Kip Steele has 20 years of project management and QA experience for firms such as FactSet and clients such as Green Mountain Coffee/Keurig, Keurig Canada, Morgan Stanley, JP Morgan Chase and Boeing.",
        "twitter": {
            "href": "https://twitter.com/qualityninja",
            "title": "qualityninja"
        },
        "sessions": [
            "building-testing-teams"
        ]
    },
    "james-sturtevant": {
        "slug": "james-sturtevant",
        "firstName": "James",
        "lastName": "Sturtevant",
        "bio": "James is a Tech Evangelist for Microsoft where he works with Startups, Students and Developers. Has been working in the web development space for 10+ years. He is focused on automating workflows including his own and he enjoys teaching and learning about his craft.",
        "twitter": {
            "href": "https://twitter.com/aspenwilder",
            "title": "aspenwilder"
        },
        "sessions": [
            "azure-event-hubs"
        ]
    },
    "michael-tamlyn": {
        "slug": "michael-tamlyn",
        "firstName": "Michael",
        "lastName": "Tamlyn",
        "bio": "Michael Tamlyn is the Principal Architect at Galen Healthcare Solutions where he works with a tight-knit team of engineers to build enterprise applications for the healthcare industry. While his professional experience has focused on data and integrations, a passion for user experience and user interface design keeps him enthralled with software development. Mike currently resides in Shelburne, VT with his wife and family.\n\nNot too long ago, [Mike Commo](/2015/speakers#michael-commo) and Mike Tamlyn were part of a team that took first place in HackVT 2013.",
        "sessions": [
            "entity-framework-code-first-migrations"
        ]
    },
    "peter-vile": {
        "slug": "peter-vile",
        "firstName": "Peter",
        "lastName": "Vile",
        "bio": "Peter Vile received his master degree from Colorado State University in computer science with a focus on software engineering specializing in distributed systems and aspect oriented middleware. Since then he has been developing web based solutions and services in the Java ecosystem in several domains such as defense, telecom and now automotive. Currently he works for Dealer.com focused on internal and external integration projects. While not chasing his two boys around he tries to stay up on messaging technologies and is currently dabbling in Scala, Play and Akka.",
        "sessions": [
            "management-of-state-in-functional-systems"
        ]
    },
    "bill-wagner": {
        "slug": "bill-wagner",
        "firstName": "Bill",
        "lastName": "Wagner",
        "bio": "Bill has spent his entire career in the software industry, spanning both technical and business roles. His mission it to teach others to write better code – and help organizations recognize the value of great software.\n\nA Microsoft regional director, Bill’s technical areas of focus are C#, .NET, and TypeScript. His other, non-coding passion is to help organizations build effective, high-functioning developer teams.\n\nAn active blogger and author, Bill has written hundreds of technical articles and two books, the best selling \"Effective C#\" and \"More Effective C#.\" His articles have appeared in MSDN Magazine, the C# Developer Center, Visual C++ Developer's Journal, Visual Studio Magazine, ASP.NET Pro, .NET Developer's Journal and more.",
        "twitter": {
            "href": "https://twitter.com/billwagner",
            "title": "billwagner"
        },
        "sessions": [
            "c-sharp-6-0"
        ]
    },
    "josh-winslow": {
        "slug": "josh-winslow",
        "firstName": "Josh",
        "lastName": "Winslow",
        "bio": "Josh Winslow is currently a development manager in Oracle's Health Sciences Global Business Unit, leading a team working to improve the safety and lower the costs of drug development. In a previous life, he worked on the Mouse Genome Informatics project, the largest store of mouse research information in the world. In his spare time he plays really complicated board games and floats in heated pools near the ocean with his wife.",
        "sessions": [
            "managing-your-career"
        ]
    }
}